In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city":['mumbai','kolkata','delhi','bangalore'],
    "temp":[32 ,43 ,43 ,21],
    "humidity":[80,90,100,78]
})
india_weather

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78

In [6]:
usa_weather = pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temp":[23,33,13],
    "humidity":[180,50,68]
})
usa_weather

       city  temp  humidity
0  new york    23       180
1   chicago    33        50
2   orlando    13        68

***marge***

In [7]:
df = pd.concat([india_weather,usa_weather])
df

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78
0   new york    23       180
1    chicago    33        50
2    orlando    13        68

id problem noticed 0123 and 012

In [8]:
df = pd.concat([india_weather,usa_weather],ignore_index=True)
df

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78
4   new york    23       180
5    chicago    33        50
6    orlando    13        68

we can also make this as key , so that we can easily get the data in future

In [9]:
df = pd.concat([india_weather,usa_weather],keys =["india","us"])
df

              city  temp  humidity
india 0     mumbai    32        80
      1    kolkata    43        90
      2      delhi    43       100
      3  bangalore    21        78
us    0   new york    23       180
      1    chicago    33        50
      2    orlando    13        68